
<?php


echo 'Объявить массив, индексами которого являются буквы русского языка, а значениями – соответствующие латинские буквосочетания (‘а’=> ’a’, ‘б’ => ‘b’, ‘в’ => ‘v’, ‘г’ => ‘g’, …, ‘э’ => ‘e’, ‘ю’ => ‘yu’, ‘я’ => ‘ya’).
Написать функцию транслитерации строк.'.'<br><hr>';

$a="";

if ( isset($_POST['var1Ex4']) ):

  $a=trim($_POST['var1Ex4']);
  
else: 

  $a="Пустая строка";
 
endif;

if (empty($a)) $a="Пустая строка";

echo '<br><br>';
echo 'Результат: '    .'<br><br>';

$mres=trnsl($a);

echo($mres);

//-------------------------

function trnsl($s){
      $arrLetters = [
      'А' => 'A', 'Б' => 'B', 'В' => 'V', 'Г' => 'G', 'Д' => 'D', 'Е' => 'E', 'Ё' => 'YO', 'Ж' => 'ZH','З' => 'Z', 'И' => 'I', 
      'Й' => 'J', 'К' => 'K', 'Л' => 'L', 'М' => 'M', 'Н' => 'N', 'О' => 'O', 'П' => 'P',  'Р' => 'R', 'С' => 'S', 'Т' => 'T', 
      'У' => 'U', 'Ф' => 'F', 'Х' => 'H', 'Ц' => 'C', 'Ч' => 'CH','Ш' => 'SH','Щ' => 'CSH','Ь' => '',  'Ы' => 'Y', 'Ъ' => '', 
      'Э' => 'E', 'Ю' => 'YU', 'Я ' => 'Ya_', 'Я' => 'YA',
      'а' => 'a', 'б' => 'b', 'в' => 'v', 'г' => 'g', 'д' => 'd', 'е' => 'e', 'ё' => 'yo', 'ж' => 'zh','з' => 'z', 'и' => 'i', 
      'й' => 'j', 'к' => 'k', 'л' => 'l', 'м' => 'm', 'н' => 'n', 'о' => 'o', 'п' => 'p',  'р' => 'r', 'с' => 's', 'т' => 't', 
      'у' => 'u', 'ф' => 'f', 'х' => 'h', 'ц' => 'c', 'ч' => 'ch','ш' => 'sh','щ' => 'csh','ь' => '',  'ы' => 'y', 'ъ' => '', 
      'э' => 'e', 'ю' => 'yu', 'я' => 'ya' , ' '=>'_' ];
    
  return strtr($s, $arrLetters);
}


?>